tutorials/fsiFoam/beamInCrossFlow/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel    nonLinearGeometryTotalLagrangian;
solidModel    unsNonLinearGeometryTotalLagrangian;
//solidModel    nonLinearGeometryUpdatedLagrangian;
//solidModel    unsNonLinearGeometryUpdatedLagrangian;

unsNonLinearGeometryTotalLagrangianCoeffs
{
    nCorrectors            1000;

    solutionTolerance      1e-7;
}

// ************************************************************************* //
