tutorials/fsiFoam/beamInCrossFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application fsiFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          0.1;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.2;

functions
(
//    beamReport
//    {
//        type pointHistory;
//        functionObjectLibs
//        (
//          "libpointHistory.so"
//        );

//        refHistoryPoint (0.45 0.15 -0.15);

//        region solid;
//    }

   setInletVelocity
   {
       type setInletVelocity;
       functionObjectLibs
       (
         "libsetInletVelocity.so"
       );
   }

   forces
   {
       type                forces;
       functionObjectLibs  ( "libforces.so" );
       outputControl       timeStep;
       outputInterval      1;
       patches             (interface);
       pName               p;
       UName               U;
       rhoName             rhoInf;
       log                 true;
       rhoInf              1000;
       CofR                (0.5 0.1 0);
   }

);

// ************************************************************************* //
